"Share on Facebook" = "Отправить в Facebook";
"Share on Twitter" = "Отправить в Twitter";
"Share on Email" = "Отправить по Email";
"Cancel" = "Отмена";
"Close" = "Закрыть";
"All" = "Все";
"Submit" = "Отправить";